#!!!!Денис, привіт. Нагадую, що я доєдналась до групи 04.08.2026 року


# task 01 == Виправте синтаксичні помилки
print("Hello",  " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples*4
#print(f'banana {banana}, apples {apples}')

# # task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4


# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(f'Периметри фігури: {perimetery}')
print('___________')

"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
print('У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше. Скільки всього дерев посадили в саду?')
#У саду посадили 4 яблуні.
apples = 4
#Груш на 5 більше яблунь
pears = apples+5
plums = apples-2 # , а слив - на 2 менше
#Скільки всього дерев посадили в саду?
trees = apples+pears+plums
print(f'Відповідь: В саду посадили {trees} дерев')
print(f'Розрахунок: яблунь {apples} + груш {pears} + слив {plums} = {trees}')
print('___________')

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
print('До обіда температура повітря була на 5 градусів вище нуля.Після обіду температура опустилася на 10 градусів.')
print('Надвечір потепліло на 4 градуси. Яка температура надвечір?')
#До обіда температура повітря була на 5 градусів вище нуля
lunch: int = 0+5
#Після обіду температура опустилася на 10 градусів.
afternoon = lunch - 10
#Надвечір потепліло на 4 градуси.
evening = afternoon + 4
print(f'Відповідь: Температура надвечір: {evening}')
print(f'Розрахунок: 0 + 5 - 10 + 4 = {evening}')
print('___________')

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
# у театральному гуртку - 24 хлопчики
guys = 24
#а дівчаток - вдвічі менше.
girls = guys / 2
#1 хлопчик захворів та 2 дівчинки не прийшли сьогодні
today = guys - 1 + girls - 2
print(f'Відповідь: Cьогодні дітей у театральному гуртку: {int(today)} дітей')
print('___________')


# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""

#Перша книжка коштує 8 грн
book1_pr = 8
#друга - на 2 грн. дороже
book2_pr = book1_pr + 2
#третя - як половина вартості першої та другої разом
book3_pr = (book2_pr + book1_pr) / 2
#Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
total = book1_pr + book2_pr + book3_pr
print(f'Вартість книг разом: {total}')
print(f'Розрахунок: вартість першої книги {book1_pr}, вартість другої - {book2_pr}, вартість третьої - {book3_pr}')